content/posts/happy-new-year-2021.md
+++
title = "新年明けましておめでとうございます"
date = 2021-01-02T20:31:00+09:00
categories = ["雑記"]
draft = false
+++

新年明けましておめでとうございます。麦汁です。昨年の終わり頃、世間では AdventCalendar で賑ってる頃に、ふと「サイトのリニューアルしたいなあ」なんてことを思って、リニューアルに着手しましたが、ようやくそれが実りそうです。

<!--more-->

なんでそんなことをしてるかというと前の記事 [Hugo 始めました]({{< relref "starting-hugo" >}}) でも書いたように「自分が作ったサイトだっせー」ってのが1つあります。

それを構築した時には「デザインとかも全部自分でやっちまおう」ということで全部やろうとしていたのですがデザインセンスが壊滅的だったとか時間がろくに取れないとかやる気が他に吸われていったとかでイマイチなまま放置していました。よくないですねえ。

あと、そことは別にブログサービスを借りて使ってるのですがそっちはそっちで更新がだるいなってのもあってリニューアルと同時に今後のブログ更新はこっちにしてしまおう、というのもあったりします。

Hugo でブログもやってしまう方が [ox-hugo](https://ox-hugo.scripter.co/) も使って記事を書き出せるので
org-mode 使い的には幸せになれそうですし。

あとは折角リニューアルしたんだからモチベーションが続くことを願っています。

というわけで 2021 年の抱負は「月に2回はブログを更新する」とします。

結構、緩めな抱負ですが、仕事じゃないのでこのぐらいの方が良かろう……。
